{"id":11607,"date":"2018-08-21T12:45:42","date_gmt":"2018-08-21T12:45:42","guid":{"rendered":"http:\/\/\/?p=11607"},"modified":"2018-08-17T12:26:41","modified_gmt":"2018-08-17T12:26:41","slug":"are-you-a-fan-or-a-disciple-of-jesus-christ-part-1","status":"publish","type":"post","link":"https:\/\/\/are-you-a-fan-or-a-disciple-of-jesus-christ-part-1\/","title":{"rendered":"ARE YOU A FAN OR A DISCIPLE OF JESUS CHRIST? PART 1"},"content":{"rendered":"<p class=\"font_9\">LUKE 14:25-35<\/p>\n<p class=\"font_9\">V.25 “A large crowd was following Jesus …”<\/p>\n<p class=\"font_9\">This was a typical day in Jesus’ life during His earthly ministry- He had many fans. Some were dazzled by His amazing miracles, others entertained by His captivating miracles, still others were impressed by how cleverly He refuted the challenges of the Pharisees and other religious leaders. Jesus was popular. The Nation was looking for a charismatic leader who would help overthrow the Roman authorities—and here was someone superbly qualified for the task. All He needed to do was flatter them, probably perform a few miracles to win their allegiance etc., but Jesus took the exact opposite approach (Opposite of what most preaching is concerned with today).<\/p>\n<p class=\"font_9\">Instead of majoring in the benefits and blessings, thrills and excitements, Jesus spoke more of the difficulties, the dangers, the sacrifices they’d have to make-to become His disciples. He was not interested in mere quantity, He was looking for men and women of quality. This is what puts a distinction between a fan and a follower. Fans tag along during the good times, watch events from the sidelines but followers of Jesus proactively pursue becoming like their Master in every way. No wonder Jesus gave the command to His disciples to “Go and make ‘Disciples’ of all nations. (Matthew 28:19). Note that He didn’t tell them to go and make church goers, Christians, believers-He was specific, Disciples. “It is not without significance that the word disciple occurs in the new testament 269 times, Christian only 3 times and believers 2 times” (Sanders 1994)<\/p>\n<p class=\"font_9\">Jesus continues to have many fans today. The church is full of people who see Jesus as their quick-fix solution to their troubled marriages, financial difficulties, health problems etc. Similarly the church is full of many preachers whose gospel is about blessings, money, healing, wealth and health thus attracting many fans. As my pastor would put it, “The gospel of Jesus Christ is not about shillings and cents, it’s about heaven and hell, righteousness and unrighteousness.” True to this proclamation, I submit to you that Jesus is engaged in a serious agenda of destroying the Kingdom of darkness &amp; He doesn’t desire to be associated with people who will slow down His agenda or who will turn back when the fighting grows fierce.<\/p>\n<p class=\"font_9\">When you made that decision to follow Christ, did you count the cost?<\/p>\n<p class=\"font_9\">God bless you!<\/p>\n<p class=\"font_9\">Write to me: pmuuo@; pmpeacepower@gmail.com<\/p>\n<p class=\"font_9\">Follow me on Facebook: https:\/\/www.facebook.com\/peter.muuo<\/p>\n","protected":false},"excerpt":{"rendered":"<p>LUKE 14:25-35 V.25 “A large crowd was following Jesus …” This was a typical day in Jesus’ life during His earthly ministry- He had many fans. Some were dazzled by [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11609,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,3,4],"tags":[],"_links":{"self":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11607"}],"collection":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/comments?post=11607"}],"version-history":[{"count":1,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11607\/revisions"}],"predecessor-version":[{"id":11610,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11607\/revisions\/11610"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/media\/11609"}],"wp:attachment":[{"href":"https:\/\/\/wp-json\/wp\/v2\/media?parent=11607"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/categories?post=11607"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/tags?post=11607"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}