{"id":11637,"date":"2018-10-12T09:00:51","date_gmt":"2018-10-12T09:00:51","guid":{"rendered":"http:\/\/\/?p=11637"},"modified":"2018-10-05T09:56:27","modified_gmt":"2018-10-05T09:56:27","slug":"beware-pridea-poisonous-weed","status":"publish","type":"post","link":"https:\/\/\/beware-pridea-poisonous-weed\/","title":{"rendered":"BEWARE! PRIDE,A POISONOUS WEED."},"content":{"rendered":"<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_def_6\" class=\" flex_vbox\">\n<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_def_7\" class=\"flex_display flex_vbox\">\n<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_title\" class=\"s_usaAWRichTextClickableSkin\" data-packed=\"false\">\n<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_titlerichTextContainer\" class=\"s_usaAWRichTextClickableSkin_richTextContainer s_usaAWRichTextClickableSkinrichTextContainer\">\n<h1 class=\"font_0 color_15\">Proverbs 16:18<\/h1>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0__type_MediaPost\" class=\" flex_vbox\">\n<div id=\"5badcfe0e6ac710837a45c88comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_mediaText\" class=\"s_usaAWRichTextClickableSkin\" data-packed=\"false\" data-proxy-name=\"MediaLabel\" data-width=\"930\">\n<div id=\"5badcfe0e6ac710837a45c88comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_mediaTextrichTextContainer\" class=\"s_usaAWRichTextClickableSkin_richTextContainer s_usaAWRichTextClickableSkinrichTextContainer\">\n<p class=\"font_9\">My name is Peter Muuo, of course many of you reading this know that. I am one of those persons who really value their reputation. I will do everything possible to safeguard my image. Recently as we were commuting home, my wife offered me a drink of porridge which I quickly turned down. It was a simple No, thanks! She wasn’t shocked, as she would later confirm to me that her gesture was just an act of  kindness, otherwise having known me for quite some time now, she knew beforehand that I wasn’t going to accept her offer[Me, taking porridge, in a matatu!No way!]. Mind you, not that anyone would have noticed.<\/p>\n<p class=\"font_9\">This need to feel dignified might not necessarily be a bad thing, but if not put in check, I acknowledge that it can puff me up in many ways and to admit it, it has, in several occasions. For instance, it was so bad at some point in my life that I only desired to be associated with the high and mighty, only those that I could gain something from in return(E.g. fame by hanging out with celebrities, financial benefits etc.). The Lord seriously rebuked me through my wife (fiancé then), [story for another day] and now by the grace of God, I daily ask God to help me appreciate everyone that comes into my life and treat them equally.<\/p>\n<p class=\"font_9\">Pride is a snare that the devil has used successfully since the creation of the world to bring destruction upon people. John Hagee quotes, “Pride is like a poisonous weed that grows in any soil without need of water or care.” No one is immune from it, it’s like a cancer that kills everyone and everything it touches.<\/p>\n<p class=\"font_9\">Our text from Proverbs 16:18 goes on to say, “Pride goes before destruction,<br \/>\na haughty spirit before a fall.” Pride always precedes destruction and a great fall.<\/p>\n<p class=\"font_9\">What is Pride and what causes it?<\/p>\n<p class=\"font_9\">Among other things, pride is first and foremost a spirit, [read v.18b—a haughty spirit]. It lifts us up so that we look down on someone or people just because we feel we are better than them. The source of this spirit is the devil himself. It was because of pride that him and the fallen angels were thrown out of heaven [Isaiah 14:12-15, Rev 12:7-12] He fell because of pride that originated from his desire to be God instead of a servant of God. Satan was the highest of all the angels [Ez 28:12-19], but he wasn’t happy. He desired to be God and rule the universe. God cast Satan out of heaven as a fallen angel.<\/p>\n<p class=\"font_9\">Pride is the spiritual power behind broken families, churches, governments and the society at large. Marriages break up mainly because of pride(No one is willing to admit their mistake); the body of Christ is sharply divided because we don’t embrace each other(some denominations feel superior than others, some pastors preach messages that are only meant to attract followers[&amp; sycophants] to build their reputation rather than preaching what’s true and to win souls.)<\/p>\n<p class=\"font_9\">Secondly, I’d say that pride is deeply rooted in idolatry- It causes people to worship themselves (e.g. Have you seen people who worship their beauty?), worship others, their possessions and abilities etc.  It makes people think that they are self-sufficient and that they don’t need no one, not even God, because they themselves have become gods. I have sometimes read about some people who call themselves gods because they pride themselves in their wealth &amp; abilities. Pharaoh is a perfect example. In Exodus 5:2, he asks Moses, “Who is the Lord? And why should I listen to Him? I don’t know the Lord and I will not let Israel go”. The rich fool in Luke 12:13-21, beat his chest for having plenty, he thought he now held the keys to his life &amp; future. God took his life that very night.<\/p>\n<p class=\"font_9\">More examples in the Bible<\/p>\n<p class=\"font_9\">There are endless examples in scripture about people who became proud and ended in destruction. I’ve mentioned some above, let’s see a few more:<\/p>\n<ol class=\"font_8\">\n<li>\n<p class=\"font_9\">It’s pride that caused Adam &amp; Eve to sin against God. Eve desired wisdom (to become like God) and that’s why she ate the fruit in the first place. When God confronted them with their sin, they couldn’t help but blame each other instead of simply accepting responsibility for their actions. In fact at one point Adam blamed God for creating the woman and giving her to him. [Seriously!!]<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">It’s pride that caused Cain to kill Abel.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">It’s pride that sent king Nebuchadnezzar to the fields to eat grass for 7 years while he should have been in his palace.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">It’s pride that orchestrated the downfall of most Kings of Israel.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">It’s this same spirit that caused the Israelites to worship other Gods. (Remember the warning in Deuteronomy 8 “Beware in your plenty that you do not forget the Lord your God). But they often forgot<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">It’s the self-righteous pride of the Pharisees that made them not accept the testimony of Jesus, ultimately crucifying him on the cross.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">It was by the same spirit that one of the thieves on the cross blatantly refused the supremacy of Jesus Christ (Luke 23:39). Even today, this Spirit is at work causing people to deny even the existence of Christ.<\/p>\n<\/li>\n<\/ol>\n<p class=\"font_9\">I do not know where you are at in your life. As I mentioned earlier, pride is a serious destroyer and all of us are her candidates. In our arrogant pride we are telling God that we don’t need Him. Working on pride is not a day’s activity, it’s a life time event that involves the daily work of the Holy Spirit. Has it touched your life, family, church? Allow God through His Holy Spirit to get it out now because your very spiritual survival is at stake. Remember that no proud man\/woman can stand before God. James 4:6.  “And he gives grace generously. As the Scriptures say, “God opposes the proud but gives grace to the humble.” I need this grace, we all do. Let’s say a prayer together:<\/p>\n<p class=\"font_9\">Father in Heaven, I thank you for your Word that has reminded me today that pride is a dangerous poison. Forgive me Lord when I have allowed it to ruin my life, my family, my work and my relationship with you. Father I ask for your grace that is freely available to all, to rest on me today, to help me live a life of humility before God and men. I acknowledge that the process of teaching me humility may not be a sweet one, but dear Lord, I am ready, for I know that you chasten those that you love. So help me God, and let your Holy Spirit richly dwell in my life. In Jesus Name I pray.<\/p>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Proverbs 16:18 My name is Peter Muuo, of course many of you reading this know that. I am one of those persons who really value their reputation. I will do everything possible [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11639,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3,4],"tags":[89],"_links":{"self":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11637"}],"collection":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/comments?post=11637"}],"version-history":[{"count":2,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11637\/revisions"}],"predecessor-version":[{"id":11640,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11637\/revisions\/11640"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/media\/11639"}],"wp:attachment":[{"href":"https:\/\/\/wp-json\/wp\/v2\/media?parent=11637"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/categories?post=11637"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/tags?post=11637"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}