{"id":11675,"date":"2019-08-30T09:48:38","date_gmt":"2019-08-30T09:48:38","guid":{"rendered":"http:\/\/\/?p=11675"},"modified":"2019-08-30T09:48:42","modified_gmt":"2019-08-30T09:48:42","slug":"the-study-of-non-verbal-books-amazing-insights-from-plants","status":"publish","type":"post","link":"https:\/\/\/the-study-of-non-verbal-books-amazing-insights-from-plants\/","title":{"rendered":"The Study of &#8216;Non-verbal&#8217; books: Amazing insights from Plants"},"content":{"rendered":"\n<p>In our discipleship program at RoG Church, we have been taking a closer look at the Spiritual Disciplines. A few weeks ago, we went through the Discipline of study and one of the concepts that was new to most of us was the study of non-verbal books. It’s the least recognized but perhaps the most important field of study. This includes but not limited to study of nature, human beings, events, cultures etc.<\/p>\n\n\n\n<p>Isaiah 55:12 for instance tells us that ‘. . .&nbsp;<em>the mountains and the hills before you shall break forth into singing, and all the trees of the field shall clap their hands<\/em>.’ The handiwork of the creator can speak to us and teach us if we listen.<\/p>\n\n\n\n<p>Often, we give take home assignments and on this particular subject, one of the tasks was to study a plant and draw lessons from it. As I was doing the marking, I received some amazing responses and insights. Allow me to share two of those:<\/p>\n\n\n\n<p><strong>Student X: The bamboo plant<\/strong><\/p>\n\n\n\n<p>-How it grows: Plant a cutting. The shoot emerges out of the ground and grows in height and diameter for around 60 days and produces limbs and leaves, then stops to grow in height and diameter after the 60 day period.<\/p>\n\n\n\n<p>-Bamboo being a colony plant uses energy from existing plants to produce more plants and expand the root structure.<\/p>\n\n\n\n<p>-The bamboo takes about 3 years to get established, then continues to get bigger from year to year as the colony grows towards maturity.<\/p>\n\n\n\n<p>-Maturity duration varies depending on species selection, soil, sunlight, climate and watering condition.<\/p>\n\n\n\n<p>-Before bamboo plant grows tall and large, the roots underground must finish growing.<\/p>\n\n\n\n<p>Lessons the bamboo plant has taught me as a believer<\/p>\n\n\n\n<ol><li><em>The foundations and conditions determine growth hence it’s important to keep watch on the doctrines to ensure they are sound and based on the Word of God, if at all we are to grow in God.<\/em><\/li><li><em>It takes time investing ourselves in the Word of God to attain maturity, this calls for patience and not giving up.<\/em><\/li><li><em>We are called to grow and reproduce just as bamboo uses energy from existing plant to produce more plants.<\/em><\/li><li><em>Maturity duration\/periods vary from one Christian to the other depending on the environment one exposes themselves to.<\/em><\/li><\/ol>\n\n\n\n<p><strong>Student Y<\/strong><\/p>\n\n\n\n<p>I studied a beautiful Lillie at our flower bed. Its flowers are white and as they blossom, they brighten the garden making it bright with some level of charm that also infuses some calm.<\/p>\n\n\n\n<p>What I learned.<\/p>\n\n\n\n<p>&nbsp;&nbsp;<em>1. The plant is a work of God<\/em><\/p>\n\n\n\n<p><em>&nbsp; 2. It never worries about its tomorrow<\/em><\/p>\n\n\n\n<p><em>&nbsp; 3. Its flowers sprout and die so that it can grow fresh ones. As a Christian, I have to keep dying to self and allow myself to be recreated into the image of God as I go through the seasons of life. The output will be beautiful and it will result in&nbsp;an&nbsp;infusion of rest and calmness.<\/em><\/p>\n\n\n\n<p><strong>Conclusion<\/strong>.<\/p>\n\n\n\n<p>For the Christian, the primary focus of our study is Scripture. Psalm 1:1 reminds us ‘<em>Blessed is the man who meditates on the law of the LORD, day and night<\/em>.’ We can also use good Christian literature and benefit from the labors of others. In addition to written books, we can pay close attention to ‘non-verbal’ books. Psalm 19 directs us to the&nbsp;<em>wonders of creations as they display God’s glory<\/em>; in Proverbs 30 we are urged to&nbsp;<em>consider ‘ants, locusts, in the pursuit of wisdom<\/em>.&nbsp;<\/p>\n\n\n\n<p>Take time to study nature,or events or human behaviors and see how much you&#8217;ll learn. For instance, pay attention to nature and see the mysteries of God displayed, study&nbsp;relationships between human beings and see for example how our speech is almost always aimed at justifying our actions because of pride and fear. You will realize that more often than not, you behave more like the Pharisees who would pray, “<em>God I thank thee that I am not like other men<\/em>.” At this point, make yourself the principal object of study and ask the Lord to deliver you from a haughty spirit.<\/p>\n\n\n\n<p>Every blessing,<\/p>\n\n\n\n<p>Peter Muuo. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>In our discipleship program at RoG Church, we have been taking a closer look at the Spiritual Disciplines. A few weeks ago, we went through the Discipline of study and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11675"}],"collection":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/comments?post=11675"}],"version-history":[{"count":1,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11675\/revisions"}],"predecessor-version":[{"id":11676,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/11675\/revisions\/11676"}],"wp:attachment":[{"href":"https:\/\/\/wp-json\/wp\/v2\/media?parent=11675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/categories?post=11675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/tags?post=11675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}