{"id":12107,"date":"2021-05-04T16:34:48","date_gmt":"2021-05-04T16:34:48","guid":{"rendered":"https:\/\/\/new\/?p=12107"},"modified":"2021-05-04T16:48:03","modified_gmt":"2021-05-04T16:48:03","slug":"six-blind-men","status":"publish","type":"post","link":"https:\/\/\/six-blind-men\/","title":{"rendered":"Six Blind Men"},"content":{"rendered":"<p>The story is told of six blind men who used their hands to try and figure out what an elephant was.<br \/>\nLeg – It’s a tree<br \/>\nTrunk – It’s a snake<br \/>\nTail – It’s a piece of old rope<br \/>\nSide – It’s a wall<br \/>\nTusk – It’s a spear<br \/>\nEar – It’s a magic carpet<\/p>\n<p>Clearly a misrepresentation of what an elephant is.<\/p>\n<p>Islam (in the Quran) refers to Christians and Jews as “People of the Book” (those who possess monotheistic scriptures), and it is true&#8230;we are People of the Book, but we (Christians) are in danger of becoming “people of the verse”.<\/p>\n<p>Like the blind men in the story, we tend to take verses and run with them not bothering to understand the whole counsel of God. We take a verse and decree and declare it over our lives ignoring the context and everything else that God has said. <\/p>\n<p>And even in our understanding of God, we have been guilty of taking hold of one attribute of God and distorting God’s character because we ignore the totality of who He is.<br \/>\nThe “world” has joined in this by deciding that the only attribute of God they are going to embrace is His Love and nothing more.<br \/>\n“God is love! He would never judge anyone or send anyone to hell! That’s not loving!”<\/p>\n<p>Some have chosen to embrace Jesus, but not the Bible – even though it’s the Scriptures that tell us about Jesus.<br \/>\n &#8220;[You] can live by the Bible or live by Jesus. [You] can&#8217;t do both.&#8221; Frank Schaeffer<\/p>\n<p>And being “People of the Verse”, reading the Book for the first time can be an uncomfortable exercise. Who is this God? Why is there so much violence?<\/p>\n<p>I’m in a Bible reading group and some people left because they were offended by the God portrayed in Scripture. They put God on trial, found Him wanting and passed judgement. He does not deserve to be God. Or as Bart Campolo put it:<br \/>\n “I cannot worship a God who is not as compassionate as I am.”<\/p>\n<p>The parts of God’s revelation in Scripture are like pieces of a puzzle, they look disjointed until you put the whole puzzle together, then it makes a picture and it makes sense. But we usually make the mistake of picking a piece and running with it or being disappointed by the piece we are holding.<\/p>\n<p>We are not the only ones who miss it. The disciples missed it. Although Jesus’ accomplished His mission to save them from sin, and usher in the kingdom of God, they kept hoping He would overthrow the Roman government. They did not understand why He came.<br \/>\n“Lord, are you at this time going to restore the kingdom to Israel? (Acts 1:6)<br \/>\nTheir expectations were not met.<\/p>\n<p>John the Baptist, filled with the Holy Spirit, from his mother’s womb, heard God (audibly) set his seal of approval on Jesus after baptizing Him (Matthew 3:13-17), missed it.<\/p>\n<p>When he was jailed by Herod, he sent his disciples to ask Jesus if He was the “One” or they should look for another. He couldn’t figure out why Jesus hadn’t overthrown the evil Roman government [and got him out of jail]. (Matthew 11:3) His expectations were not met.<\/p>\n<p>Jesus’ response is very telling, “Blessed is the man who does not fall away on account of me.” (Matthew 11:6)<br \/>\nLife may not make sense, but trust who you know that I am.<br \/>\nThings may not go as you desire, but trust in My sovereignty.<\/p>\n<p>John would later be beheaded by Herod. John had accomplished his mission on earth: to prepare the way for Jesus. And Jesus honoured John’s life and ministry. (Matthew 11:11-15)<\/p>\n<p>God is not arbitrary. He is Sovereign and He is good.<\/p>\n<p>Are you making assumptions about God based on skewed reading of the Bible?<br \/>\nAre you uncomfortable with truths you have come across in Scripture?<br \/>\nHave you put God on trial?<br \/>\nDon’t pass judgement on Him just yet&#8230;<\/p>\n<p>Don’t be in a rush<br \/>\nSit in the discomfort&#8230;<br \/>\nWrestle with it<\/p>\n<p>Get the whole picture<br \/>\nGet to know God<br \/>\nGod has revealed Himself through His word and it can only be understood in its entirety. Read the Bible and look for God. You’ll find Him.<\/p>\n<p>The truth will set you free, even if it makes you miserable at first.<\/p>\n<p> “If you believe what you like in the Gospel, and reject what you don&#8217;t like, it is not the Gospel you believe, but yourself.”― Augustine<\/p>\n<p>Today as you spend time with God, delve into His Word. He wants to be known.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The story is told of six blind men who used their hands to try and figure out what an elephant was. Leg – It’s a tree Trunk – It’s a [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":12108,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12107"}],"collection":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/comments?post=12107"}],"version-history":[{"count":1,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12107\/revisions"}],"predecessor-version":[{"id":12109,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12107\/revisions\/12109"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/media\/12108"}],"wp:attachment":[{"href":"https:\/\/\/wp-json\/wp\/v2\/media?parent=12107"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/categories?post=12107"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/tags?post=12107"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}