{"id":12119,"date":"2021-05-05T10:21:12","date_gmt":"2021-05-05T10:21:12","guid":{"rendered":"https:\/\/\/new\/?p=12119"},"modified":"2021-05-05T10:21:12","modified_gmt":"2021-05-05T10:21:12","slug":"why-isnt-god-answering-my-prayer","status":"publish","type":"post","link":"https:\/\/\/why-isnt-god-answering-my-prayer\/","title":{"rendered":"Why isn&#8217;t God Answering My Prayer?"},"content":{"rendered":"<p>Have you ever been in a place where what the Bible says and your reality seems to be at odds?<\/p>\n<p>And whatever you ask in prayer, you will receive, if you have faith.” Matt 21:22<br \/>\nI believe&#8230;why isn’t God answering my prayer?<\/p>\n<p>And this is the confidence that we have toward him, that if we ask anything according to his will he hears us. 1 John 5:14<br \/>\nMy prayer lines up with God’s will&#8230;why isn’t He answering?<\/p>\n<p>You ask and do not receive, because you ask wrongly, to spend it on your passions. James 4:3<br \/>\nIf I had cherished sin in my heart, the Lord would not have listened&#8230;Psalm 66:18<br \/>\nMy motives are pure; my sins are confessed&#8230;why isn’t God answering?<\/p>\n<p>That’s where Job found himself.<\/p>\n<p>He was suffering terribly and God was silent.<br \/>\nIt felt like God was punishing him for something&#8230;<\/p>\n<p>His friends were sure he had sinned<br \/>\nJob was certain he hadn’t<br \/>\nJob was the kind of man who offered sacrifices for his children&#8230;just in case they had sinned&#8230;he kept short accounts with God where sin was concerned.<\/p>\n<p>Job took his situation to God&#8230;<br \/>\nI will not keep silent; I will speak out in the anguish of my spirit, I will complain in the bitterness of my soul (Job 7:11)<br \/>\nWill you never look away from me, or let me alone for an instant? If I have sinned, what have I done to you, O watcher of men? Why do you make me your target? (Job 7:19-20)<br \/>\nI loathe my very life; therefore I will give free rein to my complaint and speak out in the bitterness of my soul. I will say to God: Do not condemn me, but tell me what charges you have against me. (Job 10:1-2)<\/p>\n<p>Job’s words are raw, pouring out his heart and questioning why. He may have even overstepped some boundaries with his words but God was not offended by his honesty. God admonished him for speaking “words without knowledge” (Job 38:1 – 41:34 a long and scary lecture) and Job repented (42:1-6).<\/p>\n<p>God then turns and rebukes Job’s friends “I am angry with you&#8230;because you have not spoken of me what is right, as my servant Job has&#8230;”<\/p>\n<p>Job never got an answer from God on why he went through such great suffering, but God did wipe Job’s tears at the end. (42:10-16)<\/p>\n<p>We have the privilege of being in the audience as we see what takes place between God and Satan. Job didn’t.<\/p>\n<p>Job had faith; he was asking for a good thing and he hadn’t sinned.<\/p>\n<p>God was actually showing off Job’s uprightness to Satan.<\/p>\n<p>As long as we are on this side of eternity, things will happen.<br \/>\nWe may suffer because of the fallenness of the world we live in.<br \/>\nWe may suffer as a consequence of our sin or poor choices&#8230;or&#8230;<br \/>\nWe may just suffer for reasons unknown to us.<\/p>\n<p>Our peace in suffering comes from knowing that<br \/>\n• our loving God is Sovereign over all that happens to us<br \/>\n• He sees us and is aware of what we are going through<br \/>\n• He has a reason why, which He may choose to let us in on, or not<br \/>\nHe is with us and He is not leaving (Hebrews 13:5)<\/p>\n<p>Spending time in God’s Word and seeing how He deals with His people, helps us have faith in His power and goodness. It helps us know His character and reminds us that He is a God that can be trusted.<\/p>\n<p>As you spend time with God today, be honest with Him. If things are going well, rejoice with Him, if things are falling apart, pour out your heart to Him, if you are in a dark valley, tell him. Let Him be your comfort. Let Him be your strong tower. Let Him be your joy and your salvation. He will wipe away your tears&#8230;now or later&#8230;<\/p>\n<p>These (the heroes of faith) were all commended for their faith, yet none of them received what had been promised. God had planned something better for us so that only together with us would they be made perfect. (Hebrews 11:39-40)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever been in a place where what the Bible says and your reality seems to be at odds? And whatever you ask in prayer, you will receive, if [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":12120,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,3,4],"tags":[],"_links":{"self":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12119"}],"collection":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/comments?post=12119"}],"version-history":[{"count":1,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12119\/revisions"}],"predecessor-version":[{"id":12121,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12119\/revisions\/12121"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/media\/12120"}],"wp:attachment":[{"href":"https:\/\/\/wp-json\/wp\/v2\/media?parent=12119"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/categories?post=12119"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/tags?post=12119"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}