{"id":12329,"date":"2021-05-18T05:28:25","date_gmt":"2021-05-18T05:28:25","guid":{"rendered":"https:\/\/\/new\/?p=12329"},"modified":"2021-05-18T05:28:25","modified_gmt":"2021-05-18T05:28:25","slug":"is-satan-real-does-he-exist","status":"publish","type":"post","link":"https:\/\/\/is-satan-real-does-he-exist\/","title":{"rendered":"Is Satan Real? Does he Exist?"},"content":{"rendered":"<p>Is Satan Real? Does he exist?<br \/>\nA survey conducted by the Barna Group in 2009 found that 4 out of 10 (40%) Christians in America believed that Satan “is not a living being, but a symbol of evil”. In 2015 66% of American Christians didn’t believe Satan was real.<\/p>\n<p>In a Barna survey in 2020 56% of Americans said “Satan is not merely a symbol of evil but is a real spiritual being and influences human lives.” 49% on the other hand, said they were not entirely sure that God exists.The authors concluded that, “Americans are now more confident about the existence of Satan than they are of God!”<\/p>\n<p>A 2021 Barna survey has found that only 6% American adults possess a Biblical worldview. 88% of Americans cannot be defined by any one predominant worldview. Instead they have a blend of commonly held views (Syncretism: a mixture of different beliefs and worldviews).<\/p>\n<p>Coming back home, Kenya has been called a Christian nation but we can’t ignore the syncretism in our society. We may not have the actual numbers but we can see it. We tend to lionize the devil and see him behind every bush and under every rock and he provides a booming business even in our churches.<\/p>\n<p>Is Satan real? Does he exist?<br \/>\nSatan is fine with either a Yes or No answer depending on who is asking and why. Syncretism will portray Satan on a spectrum from a goofy powerless cartoon character to an all-powerful being – and he is fine with that because many will be deceived. Satan himself is the source of lies. Hollywood has also been a source of much misinformation about Satan.<\/p>\n<p>The Bible says he exists.<br \/>\nJesus says he exists.<br \/>\n“&#8230;the devil&#8230;was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.” (John 8:44)<\/p>\n<p>The Bible tells us the truth -about who Satan (the devil) really is – and we can trust that information.<br \/>\nHis name, Satan, means “adversary or enemy”<br \/>\nDevil means “false accuser or slanderer”<br \/>\nHe’s the tempter (1 Thess 3:5), the evil one (Matt 13:19, 38) the accuser of our brothers (Rev 12:10), the deceiver (Rev 20:3)&#8230;<\/p>\n<ul>\n<li>The Bible also tells us the truth about what Satan is not and what he can’t do.<br \/>\nHe is not all powerful, everywhere present or all knowing. He is a created, limited being. He approaches God as a surbodinate (Job 1:6)<br \/>\nHe cannot act without permission (see Job).<br \/>\nHe cannot force believers to do anything (Acts 26:18)<br \/>\nHe does not know the future (Isaiah 46:9-10)<br \/>\nHe is a defeated enemy. (Colossians 2:15)<br \/>\nHe can be resisted (James 4:7)<\/li>\n<\/ul>\n<p>Is Satan real? Does he exist?<br \/>\nYes and he is a formidable enemy but the good news is: Greater is He who is in us (1 John 4:4). Jesus has disaramed all powers and authorities. He made a public spectacle of them and triumphed over them by the cross. (Colossians 2:15)<\/p>\n<p>Spiritual warfare is real (Ephesians 6:10-18) and the devil is in the propaganda business but we are not unaware of his schemes (2 Cor 11b) we have the correct information about him (our enemy) and we are fighting from victory.<\/p>\n<p>The greatest trick the devil ever pulled was convincing the world he doesn’t exist. The greatest lie he continues to propagate is that there’s plenty of time to get right with God.<\/p>\n<p>Today as we spend time with God, let’s allow Him to search our hearts to find out if we have allowed worldviews that are in contradiction with the Truth of God’s Word to influence our thinking and belief. Let us trust God to help us so that our faith, utterance and practice will be in tune with God’s Word.<\/p>\n<p><em><strong>-Beatrice Odongo-<\/strong><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is Satan Real? Does he exist? A survey conducted by the Barna Group in 2009 found that 4 out of 10 (40%) Christians in America believed that Satan “is not [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":12330,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12329"}],"collection":[{"href":"https:\/\/\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/comments?post=12329"}],"version-history":[{"count":1,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12329\/revisions"}],"predecessor-version":[{"id":12331,"href":"https:\/\/\/wp-json\/wp\/v2\/posts\/12329\/revisions\/12331"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/media\/12330"}],"wp:attachment":[{"href":"https:\/\/\/wp-json\/wp\/v2\/media?parent=12329"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/categories?post=12329"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/\/wp-json\/wp\/v2\/tags?post=12329"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}