{"id":11598,"date":"2018-07-27T11:30:36","date_gmt":"2018-07-27T11:30:36","guid":{"rendered":"http:\/\/rogchurchkenya.org\/?p=11598"},"modified":"2018-08-09T11:41:57","modified_gmt":"2018-08-09T11:41:57","slug":"receiving-the-unshakable-kingdom-2","status":"publish","type":"post","link":"https:\/\/rogchurchkenya.org\/receiving-the-unshakable-kingdom-2\/","title":{"rendered":"RECEIVING THE UNSHAKABLE KINGDOM"},"content":{"rendered":"<p><strong><u>PART II: SALVATION; WHAT IT IS NOT<\/u><\/strong><\/p>\n<p>In Part I, we looked deeply on what it means to receive salvation. In part II, I will seek to point out what salvation is not (a few misconceptions about salvation). To many, salvation is merely a matter of mental acceptance, but they forget what Eph 2:8 says, that salvation is not a product of our works, self-righteousness etc. It’s a gift from God. Let’s look at a few things that salvation is not:<\/p>\n<ul>\n<li>Salvation is not joining the church and being a faithful member. Many are active members in the church yet not members of God’s family.<\/li>\n<li>Salvation is not enlisting in good programs and activities.<\/li>\n<li>Salvation is not volunteering to help the needy.<\/li>\n<li>Salvation is not a new year’s resolution.<\/li>\n<li>Salvation is not taking responsibility to craft our own morality; … just to mention a few.<\/li>\n<\/ul>\n<p><strong>CONCLUSION<\/strong><\/p>\n<p>Salvation is <strong>needed<\/strong> and <strong>possible to attain<\/strong>. What’s more, it’s <strong><u>available<\/u><\/strong> as long as you still have breath. Salvation will change you from living a guilt-incurring life of sin to living a forgiven life of trust in Christ. To attain it, we must repent our sins and trust in Him (Romans 10:9). Some reading this article have already heard God’s call and felt a desperate need for salvation but haven’t yet made that decision. If that’s you, consider the following passages of scripture;<\/p>\n<p><strong>Romans 13:11-14<\/strong> “<em>This is all the more urgent, for you know how late it is; time is running out. Wake up, for our salvation is nearer now than when we first believed.<\/em><em> <strong><sup>12 <\/sup><\/strong>The night is almost gone; the day of salvation will soon be here. So remove your dark deeds like dirty clothes, and put on the shining armor of right living. <strong><sup>13 <\/sup><\/strong>Because we belong to the day, we must live decent lives for all to see. Don’t participate in the darkness of wild parties and drunkenness, or in sexual promiscuity and immoral living, or in quarreling and jealousy. <strong><sup>14 <\/sup><\/strong>Instead, clothe yourself with the presence of the Lord Jesus Christ. And don’t let yourself think about ways to indulge your evil desires<\/em>.”<\/p>\n<p><strong>II Peter 3:8-9<\/strong> “<em>But you must not forget this one thing, dear friends: A day is like a thousand years to the Lord, and a thousand years is like a day.<\/em><em> <strong><sup>9 <\/sup><\/strong>The Lord isn’t really being slow about his promise, as some people think. No, he is being patient for your sake. He does not want anyone to be destroyed, but wants everyone to repent<\/em>.”<\/p>\n<p>If you’re the one that God is speaking to through His Word, repeat this simple prayer. “Lord Jesus, I acknowledge that I am a sinner, but you died on the cross for my sins. Forgive me today, give me an inheritance in your Kingdom and come and make my heart your home-In Jesus Name.”<\/p>\n<p>There you go! You’ve received the promise of <strong>The Unshakable Kingdom<\/strong>!!! Praise God for it and join a God centered-Bible believing church.<\/p>\n<p>May the Lord richly bless you.<\/p>\n<p><strong><u>Peter Muuo, July 27<sup>th<\/sup> 2018<\/u><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>PART II: SALVATION; WHAT IT IS NOT In Part I, we looked deeply on what it means to receive salvation. In part II, I will seek to point out what [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11596,"comment_status":"open","ping_status":"open","sticky":true,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11598"}],"collection":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/comments?post=11598"}],"version-history":[{"count":1,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11598\/revisions"}],"predecessor-version":[{"id":11599,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11598\/revisions\/11599"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media\/11596"}],"wp:attachment":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media?parent=11598"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/categories?post=11598"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/tags?post=11598"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}