{"id":11595,"date":"2018-07-26T11:17:27","date_gmt":"2018-07-26T11:17:27","guid":{"rendered":"http:\/\/rogchurchkenya.org\/?p=11595"},"modified":"2018-08-09T11:28:13","modified_gmt":"2018-08-09T11:28:13","slug":"receiving-the-unshakable-kingdom","status":"publish","type":"post","link":"https:\/\/rogchurchkenya.org\/receiving-the-unshakable-kingdom\/","title":{"rendered":"RECEIVING THE UNSHAKABLE KINGDOM"},"content":{"rendered":"<p><strong><u>PART I: SALVATION; WHAT IT IS.<\/u><\/strong><\/p>\n<p>The Kingdom of God is <strong><em><u>The Unshakable Kingdom<\/u><\/em><\/strong> reads Hebrews 12:28. It’s available to everyone but sadly only a few get to experience it. If you’ve been wondering about what this salvation (born again) thing is, walk with me as I break it down in the most simple of ways. It’s my prayer that by the end of your reading, you will consider embracing this Kingdom which can never be shaken.<\/p>\n<p>In this world, there are many things that govern our daily lives for instance, the constitution. We obediently follow its stipulations because we believe in law and order. Similarly in the Christian world, there is a government headed by God Himself. He has given us a constitution to abide by namely The Word of God (The Holy Scriptures, The Bible). I will refer to this guide throughout my article because it’s the only sound basis of reference in matters Faith. 1 John 5:9 “<em>Since we believe human testimony, surely we can believe the greater testimony that comes from God. And God has testified about his Son<\/em>.” Choose to believe what the scriptures will tell you and at the end you will be transformed person.<\/p>\n<p>In the beginning (Genesis 1:1) God created the heavens and the earth (The universe) and everything that is in it. In His Love, wisdom and power, He also created us (man) Gen 1:26-27 to govern over all that He had created. Man was created to be friends with God and to dwell in His presence (at the garden of Eden Gen 2:8). Here, God would interact with man and fellowship with Him always. Although God governed man, He gave him a free will so that he could choose without coercion to love God back. Man chose by himself to go his own way and his friendship with God was broken. This is what the Bible calls SIN, and this is when sin first entered the earth and with disastrous effects (Separation from God, death). Gen 3:1-7, Rom 3:23, Rom 6:23. Having been created with the capacity to love and obey God, this capacity was perverted, wasted and twisted by sin.<\/p>\n<p>Although angry with man&amp; his sin, God’s love for him still remained and He desired to re-establish the fellowship that existed before. It is for this reason that God sent His only begotten son, without sin (John 3:16) to die on the cross as a sacrificial lamb for our sins. His death paved way to reach God(The Father) again and since then, for anyone to experience God’s love and plan for His life and receive The Unshakable Kingdom,  they ought to receive Christ by inviting Him into their lives &amp; trusting Him to forgive their sins, John 14:6. The Bible promises eternal life (<em>The Unshakable Kingdom<\/em>) to all who repent of their sins and receive Christ (1 John 5:11-13). This is what salvation is and it’s a free gift available to all (Eph 2:8) but only those who pursue it receive it. Joel 2:32 “Everyone who calls on the name of the LORD will be saved.”… And the promise is eternal life John 3:16, 36.<\/p>\n<p>In John 3, we read about a religious leader named Nicodemus who came to speak to Jesus at night. He wanted to know what he could do to inherit the Kingdom of God. Jesus didn’t tell him to continue with his religious obligations, keep up the good work etc., He told him that he needed a whole new life (to be born again) which only God gives to those who believe. It’s important to note that God is sovereign and has the capability of turning all of us from sin to salvation but in His design and wisdom, he leaves it upon us to decide the path we want for our lives. For instance, in Acts 10 we see a Roman soldier named Cornelius. The Bible records that he was a devout man who feared God, gave generously to the poor and prayed regularly to God. He was a good man for sure, with good deeds but we see God desiring to bring him to Himself and so he sent Peter to preach the good news and him &amp; his household received salvation. God in His sovereign power could have chosen to convert Cornelius, but He allowed him to make the choice for himself after hearing the gospel. Of course, the power behind the decision was Gods’ through His Holy Spirit who convicts the hearer of his\/her sin, guilt and helplessness. John 6:44   &#8220;<em>No one can come to me unless the Father who sent me draws them, and I will raise them up at the last day.<\/em>”<br \/>\n<strong><u>Peter Muuo, July 26<sup>th<\/sup> 2018<\/u><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>PART I: SALVATION; WHAT IT IS. The Kingdom of God is The Unshakable Kingdom reads Hebrews 12:28. It’s available to everyone but sadly only a few get to experience it. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11596,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11595"}],"collection":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/comments?post=11595"}],"version-history":[{"count":1,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11595\/revisions"}],"predecessor-version":[{"id":11597,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11595\/revisions\/11597"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media\/11596"}],"wp:attachment":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media?parent=11595"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/categories?post=11595"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/tags?post=11595"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}