{"id":11601,"date":"2018-08-17T12:10:13","date_gmt":"2018-08-17T12:10:13","guid":{"rendered":"http:\/\/rogchurchkenya.org\/?p=11601"},"modified":"2018-08-17T12:10:13","modified_gmt":"2018-08-17T12:10:13","slug":"a-call-to-faithfulness","status":"publish","type":"post","link":"https:\/\/rogchurchkenya.org\/a-call-to-faithfulness\/","title":{"rendered":"A CALL TO FAITHFULNESS"},"content":{"rendered":"<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_WholeSinglePost\" class=\"flex_display flex_vbox\">\n<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_mediaSpace_child\">INTRODUCTION<\/div>\n<div id=\"comp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0__type_MediaPost\" class=\" flex_vbox\">\n<div id=\"5b6447c6e6ac710c2df5ab7bcomp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_mediaText\" class=\"s_usaAWRichTextClickableSkin\" data-packed=\"false\" data-proxy-name=\"MediaLabel\" data-width=\"930\">\n<div id=\"5b6447c6e6ac710c2df5ab7bcomp-jk1c3bq3_SinglePostMediaTop_MediaPost__0_0_mediaTextrichTextContainer\" class=\"s_usaAWRichTextClickableSkin_richTextContainer s_usaAWRichTextClickableSkinrichTextContainer\">\n<p class=\"font_9\">To grow in Christ-likeness signifies we must grow in Christ-like attributes. One of His attributes is this, “He is entirely faithful.” Psalms 89:8(b); and He’s calling us to become increasingly faithful to Him and others. Moreover, Faithfulness is a fruit of the Holy Spirit which ought to be evident in every believer&#8217;s life. Is it possible to have for instance; faithful servants of Christ?, government officers who are courageous enough to say no to compromises?, men &amp; women who are faithful to their partners despite the perverseness around? Young people who can abstain until marriage? Employees who are faithful to their bosses? Etc.  The question I find asking myself today is, Can God really count on me? even when it costs me something?<\/p>\n<p class=\"font_9\">JEREMIAH 35:1-19- THE RECHABITES<\/p>\n<p class=\"font_9\">In Jeremiah 35:1-19, we see a people group that God described as Faithful, The Rechabites. The Rechabites (also Recabites, Rekabites) were a nomadic people group known for their strict rules to abstain from wine, from building houses, from sowing seed, and from planting vineyards (Jeremiah 35:6–7). They were faithful to abide by these rules through the generations, all the way from the time of King Jehu (2 Kings 10:15) to the time of Jeremiah (Jeremiah 35:8–10)—over 200 years, While the rest of the nation was breaking its covenant before God.<\/p>\n<p>They were descendants of Rechab (or Recab or Rekab), a Kenite and thus related to the Midianites and Moses’ family by marriage (see Judges 1:16). According to Jeremiah 35:6, the Rechabites’ strict rules were put in place by a son (or descendant) of Rechab named Jehonadab (or Jonadab). This is the same Jehonadab who helped Jehu rid Israel of Baal-worship after the time of Ahab (2 Kings 10:15–27). For 200 years, the Recabites had obeyed their ancestor’s vow to abstain from wine, they were steadfast in their commitment.<\/p>\n<p class=\"font_9\">God desired that the rest of the people would remain as committed to their covenant with Him as the Recabites were to their vow. God had Jeremiah tempt the Recabites with wine to demonstrate their dedication and commitment as a lesson to the rest of the people of Israel. God knew that they wouldn’t break their vow. (Would God have such confidence in you?)<\/p>\n<p class=\"font_9\">There is a vivid contrast between the Recabites and other Israelites:-<\/p>\n<ol class=\"font_8\">\n<li>\n<p class=\"font_9\">The Recabites had obeyed for hundreds of years; the Israelites had disobeyed for hundreds of years.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">They kept their vows to a fallible human leader; the Israelites broke their covenant with their infallible divine leader.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">Jehonadab told his family only once not to drink wine and they obeyed; God repeatedly commanded Israel to turn from sin and they refused<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">The Recabites obeyed laws that dealt with temporal issues; Israel refused to obey God’s laws that dealt with eternal issues.<\/p>\n<\/li>\n<li>\n<p class=\"font_9\">The Recabites were rewarded v19; the Israelites would be punished.<\/p>\n<\/li>\n<\/ol>\n<p class=\"font_9\">CONCLUSION<\/p>\n<p class=\"font_9\">Friends, it’s unfortunate that most of us are faithful only to the degree that it’s advantageous to us or to the degree that someone is keeping an eye on us. Beyond that, most people are never willing to go the distance. Christ was faithful to the Father even to the point of death on the cross. This is the same attitude we should embrace first to God, then to others, in all aspects of our lives. Faithfulness will be rewarded in this life and in eternity. Just like Jehonadab was rewarded with descendants who served God, we too shall be rewarded greatly if we remain steadfast. “To the faithful, He shows Himself faithful, to those with integrity, He shows integrity.” Psalm 18:25<\/p>\n<p class=\"font_9\">Consider Matthew 25:21 His master replied, &#8216;Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Enter into the joy of your master!&#8217;” Personally, these are the words I desire to hear from my Master Jesus. How about you?<\/p>\n<p class=\"font_9\">I call upon you to examine your life and ask the Lord to create a loyal\/steadfast spirit within you, a spirit willing to obey Him.<\/p>\n<p class=\"font_9\">Blessings,<\/p>\n<p class=\"font_9\">Muuo<\/p>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>INTRODUCTION To grow in Christ-likeness signifies we must grow in Christ-like attributes. One of His attributes is this, “He is entirely faithful.” Psalms 89:8(b); and He’s calling us to become [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11605,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,3],"tags":[],"_links":{"self":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11601"}],"collection":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/comments?post=11601"}],"version-history":[{"count":1,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11601\/revisions"}],"predecessor-version":[{"id":11606,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/11601\/revisions\/11606"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media\/11605"}],"wp:attachment":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media?parent=11601"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/categories?post=11601"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/tags?post=11601"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}