{"id":12215,"date":"2021-05-11T06:01:30","date_gmt":"2021-05-11T06:01:30","guid":{"rendered":"https:\/\/rogchurchkenya.org\/new\/?p=12215"},"modified":"2021-05-11T06:05:24","modified_gmt":"2021-05-11T06:05:24","slug":"truth-is-a-person","status":"publish","type":"post","link":"https:\/\/rogchurchkenya.org\/truth-is-a-person\/","title":{"rendered":"Truth Is A Person"},"content":{"rendered":"<p>My father is a pastor. When my niece was young, pre-school, he’d tell her, “Finish your tea or you’ll die”. (The things we say to get our kids to hurry up and finish eating). I’m not sure she understood the concept of death; she just knew it was something bad. It went on for a while until one day she responded with a question: “Does God drink tea?”<\/p>\n<p>You could see the theological wheels turning in my father’s brain as he searched for an answer&#8230;If I say Yes, I’ll be lying&#8230;but if I say No&#8230;where will this conversation go&#8230;? He decided to go with “No, God does not drink tea.”<\/p>\n<p>Without missing a beat after swallowing her mouthful of tea, my niece responded, “He’ll die.” Suffice it to say, my dad learned to be more realistic and truthful about his urgings and warnings.<\/p>\n<p>This incident came to mind as I was thinking about truth, who God is and who we believe He is.<\/p>\n<p>It’s been said that we are living in a post-truth world. The Cambridge Dictionary defines “Post-truth” as “relating to a situation in which people are more likely to accept an argument based on their emotions and beliefs, rather than one based on facts.<\/p>\n<p>Many people today, both Christians and non-Christians believe in an (their) idea of Jesus rather than on Jesus Himself. We have this idea of a hippy-make-love-not-war-Jesus or activist-Jesus or my-next-door-buddy-Jesus or my-ATM-Jesus or Fire-fighter-Jesus or safe-Jesus or even put-one-foot-wrong-and-you-are-dead-Jesus. All caricatures; not the real Jesus.<\/p>\n<p>Yet Truth is not an idea or a concept, but a person. Jesus said, “I am the Way, the Truth and the Life. No one comes to the Father but by Me.” (John 14:6) If the Truth is a person, then the only way we can know Truth is through relationship. Truth is not a thing we look for but a Person we get to know, listen to and obey.<\/p>\n<p>Infact Jesus said He came to seek and to save the lost (Luke 19:10). He has done the work. It is finished. But our fallen nature wants to earn its own way into God’s Kingdom. We don’t want to come in through relationship; we want to come in through merit.<\/p>\n<p>Truth can be known, if we are willing to lay down our ideas and meet Him on His own terms.<\/p>\n<p>When Job met Him, his response was: “My ears had heard of you but now my eyes have seen you. Therefore I despise myself and repent in dust and ashes.” (Job 42:5)<\/p>\n<p>When Isaiah met Him, his response was: “Woe to me! I am ruined! For I am a man of unclean lips, and I live among a people of unclean lips, and my eyes have seen the King, the Lord Almighty.” (Isaiah 6:5)<\/p>\n<p>When Peter met Him, his response was: “Go away from me, Lord; I am a sinful man!” Then he left everything and followed Him. (Luke 5:8, 11)<\/p>\n<p>When Thomas finally “met” Him, his response was: “My Lord and my God!” (John 20:28)<\/p>\n<p>What is the starting point of meeting this Jesus?<\/p>\n<p>Jesus said; “Now this is eternal life: that they may know you the only true God and Jesus Christ, whom you have sent.” (John 17:3)<\/p>\n<p>Jesus is Love, Just, Kind, Meek, Humble, Caring, Compassionate and He is also Righteous, Holy, Lord, Judge and King.<br \/>\nWe do well to come to Him on His terms.<\/p>\n<p>This Jesus says:<br \/>\n“I am the Way, the Truth and the Life. No one comes to the Father but by Me.” (John 14:6)<\/p>\n<p>“Come to me, all of you who are weary and carry heavy burdens, and I will give you rest.” (Matthew 11:28)<\/p>\n<p>“All who love me will do what I say. My Father will love them, and we will come and make our home with each of them.” (John 14:23)<\/p>\n<p>Do not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell. (Matthew 10:28)<\/p>\n<p>A.W. Tozer says, “What I believe about God is the most important thing about me.”<\/p>\n<p>What do you believe about God?<br \/>\nWhat are you basing your beliefs on?<br \/>\nHis revelation of Himself or your emotions and personal beliefs?<\/p>\n<p>These people honor me with their lips, but their hearts are far from me. They worship me in vain; their teachings are merely human rules. (Matthew 15:8-9)<\/p>\n<p>Today as we spend time with in God’s presence, may we embrace true eternal life as we cultivate relationship with the One true God and Jesus Christ, the Truth, whom He has sent.<\/p>\n<p>To all who received Him, to those who believed on His name, He gave the right to become children of God. (John 1:12)<br \/>\nThat’s relationship!<\/p>\n<p><em><strong>-Beatrice Odongo-<\/strong><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>My father is a pastor. When my niece was young, pre-school, he’d tell her, “Finish your tea or you’ll die”. (The things we say to get our kids to hurry [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":12216,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,3,4],"tags":[],"_links":{"self":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/12215"}],"collection":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/comments?post=12215"}],"version-history":[{"count":2,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/12215\/revisions"}],"predecessor-version":[{"id":12218,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/posts\/12215\/revisions\/12218"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media\/12216"}],"wp:attachment":[{"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/media?parent=12215"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/categories?post=12215"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/rogchurchkenya.org\/wp-json\/wp\/v2\/tags?post=12215"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}